examples/capillary/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*|
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  3.0.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// PEO 800K in water

// Solvent Viscosity
eta_s           [1 -1 -1 0 0 0 0]   0.001;

// Density (solvent density in dilute regime)
rho             [1 -3 0 0 0 0 0]    998;

// Polymer relaxation time for the coil-stretch transition (Zimm time)
tau_Z           [0 0  1 0 0 0 0]    0.000255;


// Polymer extensibility L/R0
xi              [0 0  0 0 0 0 0]    32.0;

// Additional zero-shear viscosity due to polymer (measured by viscometer)
eta_p           [1 -1 -1 0 0 0 0]   0.00034;

// Extensional viscosity (tuned to match pressure drop)
eta_E           [1 -1 -1 0 0 0 0]   14.;

// Critical strain rate for extended polymer
epsdot_c        [0 0 -1 0 0 0 0]    45000.0;

// ************************************************************************* //
